**Gözlem Ve Değişken Seçimi : Loc & iLoc**

In [1]:
import numpy as np
import pandas as pd

In [2]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    28     7     6
1    20     7    13
2     6    24    20
3     1    18    29
4     2    29     2
5    24    12     7
6     9     5    12
7    15     4     6
8    20    28     3
9    28    19    21

**Loc: Tanımlandığı şekli ile seçim yapmak için kullanılır.**

In [3]:
df.loc[0:3]

   var1  var2  var3
0    28     7     6
1    20     7    13
2     6    24    20
3     1    18    29

In [4]:
df.iloc[0:3]

   var1  var2  var3
0    28     7     6
1    20     7    13
2     6    24    20

In [5]:
df.iloc[0,0]

28

In [7]:
df

   var1  var2  var3
0    28     7     6
1    20     7    13
2     6    24    20
3     1    18    29
4     2    29     2
5    24    12     7
6     9     5    12
7    15     4     6
8    20    28     3
9    28    19    21

In [6]:
df.iloc[:3,:2]

   var1  var2
0    28     7
1    20     7
2     6    24

In [8]:
df.loc[0:3,"var3"]

0     6
1    13
2    20
3    29
Name: var3, dtype: int32

In [17]:
df.iloc[0:3,2:3] #üstteki gibi kullanılamaz bu şekilde kullanılmalı

   var3
0     6
1    13
2    20

In [18]:
df.iloc[0:3]["var3"]

0     6
1    13
2    20
Name: var3, dtype: int32